name: "CaffeNet"
layers {
  name: "mnist"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  image_data_param {
    source: "/home/evgeniy/file_list.txt"
    batch_size: 2000
    new_height: 28
    new_width: 28
  }
include: { phase: TRAIN }
}
layers {
  name: "mnist"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  image_data_param {
    source: "/home/evgeniy/file_list.txt"
    batch_size: 2000
    new_height: 28
    new_width: 28
  }
  include: { phase: TEST }
}
layers {
  name: "ip"
  type: INNER_PRODUCT
  bottom: "data"
  top: "ip"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  include: { phase: TEST }
}
layers {
  name: "argmax"
  type: ARGMAX
  bottom: "ip"
  top: "argmax"
}

