name: "Linear"
layers {
  name: "data"
  type: MEMORY_DATA
  top: "data"
  top: "label"
  memory_data_param {
  batch_size: 1
  channels: 1
  height: 28
  width: 28
  }
}
layers {
  name: "ip"
  type: INNER_PRODUCT
  bottom: "data"
  top: "ip"
  inner_product_param {
    num_output: 10
  }
}
layers {
  name: "loss"
  type: SOFTMAX
  bottom: "ip"
  top: "loss"
}
layers
{
  name: "argmax"
  type: ARGMAX
  bottom: "loss"
  top: "argmax"
}
